betaflight/betaflight/src/platform/CH32/startup/ch32h417_conf.h
/********************************** (C) COPYRIGHT *******************************
* File Name          : ch32h417_conf.h
* Author             : WCH
* Version            : V1.0.0
* Date               : 2025/03/01
* Description        : Library configuration file.
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#ifndef __CH32H417_CONF_H
#define __CH32H417_CONF_H

#include "ch32h417_adc.h"
#include "ch32h417_can.h"
#include "ch32h417_crc.h"
#include "ch32h417_dac.h"
#include "ch32h417_dbgmcu.h"
#include "ch32h417_dfsdm.h"
#include "ch32h417_dma.h"
#include "ch32h417_dvp.h"
#include "ch32h417_ecdc.h"
#include "ch32h417_eth.h"
#include "ch32h417_exti.h"
#include "ch32h417_flash.h"
#include "ch32h417_fmc.h"
#include "ch32h417_gpha.h"
#include "ch32h417_gpio.h"
#include "ch32h417_hsadc.h"
#include "ch32h417_hsem.h"
#include "ch32h417_i2c.h"
#include "ch32h417_i3c.h"
#include "ch32h417_it.h"
#include "ch32h417_ipc.h"
#include "ch32h417_iwdg.h"
#include "ch32h417_lptim.h"
#include "ch32h417_ltdc.h"
#include "ch32h417_opa.h"
#include "ch32h417_pwr.h"
#include "ch32h417_qspi.h"
#include "ch32h417_rcc.h"
#include "ch32h417_rng.h"
#include "ch32h417_rtc.h"
#include "ch32h417_sai.h"
#include "ch32h417_sdio.h"
#include "ch32h417_sdmmc.h"
#include "ch32h417_serdes.h"
#include "ch32h417_spi.h"
#include "ch32h417_swpmi.h"
#include "ch32h417_tim.h"
#include "ch32h417_usart.h"
#include "ch32h417_wwdg.h"
#include "ch32h417_usbpd.h"
// #include "ch32h417_usb.h"
#include "PIOC_SFR.h"


#endif


	
	
	
